
{
  "Suits": [
    {
      "id": 1,
      "imagen": "https://pm1.aminoapps.com/6707/446ac3e7ad05d24361d4551e49b118477273e6e6_hq.jpg",
      "descripcion": " MK I was built by Tony Stark while he was held captive in a cave in Afghanistan after being kidnapped by a terrorist group. Using his technological genius and the limited resources available, Stark created this primitive but functional combat suit. The suit was made of scrap metal and had a rudimentary design compared to future versions.."
    },
    {
      "id": 2,
      "imagen": "https://pm1.aminoapps.com/6707/2333556fb88457ed3f21364dbcde293a91485156_hq.jpg",
      "descripcion": "The MK II still had some limitations and was not completely combat ready in its initial form. However, it laid the foundation for future improvements and became a crucial prototype for the development of more advanced Iron Man suits.."
    },
    {
      "id": 3,
      "imagen": "https://pm1.aminoapps.com/6707/ff220e91e676ed6e2cfb56da26eec37a49c112cc_hq.jpg",
      "descripcion": "This suit was characterized by its much more refined and stylized design. It was constructed of a gold-titanium alloy, making it extremely strong and lightweight at the same time. One of the most notable features of the MK III was its ability to fly, thanks to the repulsion thrusters located in the feet and hands. Additionally, it was equipped with a wide variety of weapons and gadgets, including laser beams and missiles. It also featured an advanced communications system and a sophisticated control interface that allowed Tony Stark to operate the suit more efficiently."
    },
    {
      "id": 4,
      "imagen": "https://pm1.aminoapps.com/6707/93bec53edbd92da73889694845543daef75bc35b_hq.jpg",
      "descripcion": "Like its predecessors, this suit was constructed from an advanced alloy, making it durable and highly protective. However, one of the key differences lay in its exterior design, which featured a smoother, sleeker finish. A distinctive feature of the MK IV was its shape-shifting ability, allowing the suit's parts to dynamically adjust to Tony Stark's needs. This made the suit more versatile and adaptable in combat and flight situations."
    },
    {
      "id": 5,
      "imagen": "https://i.pinimg.com/originals/af/87/0f/af870f91c72ef8d04f3ea6e76ad76d69.jpg",
      "descripcion": "The MK V, nicknamed 'Iron Man Briefcase', was specifically designed to be compact and transportable. Unlike previous suits that required a workshop or a special facility to be equipped, the MK V had the peculiarity of being able to be folded and stored in a sturdy briefcase."
    },
    {
      "id": 6,
      "imagen": "https://pm1.aminoapps.com/6707/3f469e2ae316a3973b1cfcec31c3b04952024873_hq.jpg",
      "descripcion": "The MK VI was designed with greater efficiency and versatility in mind. This suit incorporated several technological improvements, including an improved propulsion system and increased endurance compared to previous versions. A notable feature of the MK VI was the inclusion of nanomachine technology. This allowed the suit to dynamically form and fit Tony Stark in a matter of seconds. Additionally, the MK VI featured greater flight capability and maneuverability, making it extremely agile in the air and in combat."
    },
    {
      "id": 7,
      "imagen": "https://pm1.aminoapps.com/6707/534097bc96b91a0bd2a667f4c37f2d776280ae0d_hq.jpg",
      "descripcion": "The MK VII was designed as an improved version of the MK VI and featured several advanced features. One of the most notable features of this suit was its ability to be summoned from a distance. Tony Stark could call the suit and it would fly from its storage location to join him in a matter of seconds, which was extremely convenient in emergency situations."
    },
    {
      "id": 8,
      "imagen": "https://pm1.aminoapps.com/6707/a8e199e607408534155fbfa2421ebe79c0d1df9a_hq.jpg",
      "descripcion": "MK VIII was also the first of several Iron Man armors created during a rapid period of development that led to the creation of the Iron Legion. It was destroyed by the 'Clean Slate' protocol activated by Stark."
    },
    {
      "id": 9,
      "imagen": "https://pm1.aminoapps.com/6708/61d69c7c91fc4eacb21784817174304d523d8bb0_hq.jpg",
      "descripcion": "After Stark destroyed the MK XLII in a failed attempt to kill Killian, the MK IX appeared targeting Killian and Virginia Potts, as they both displayed the heat signatures of Extremis."
    },
    {
      "id": 10,
      "imagen": "https://pm1.aminoapps.com/6708/44237a501722c03bbe8d5f8acdcdd1dd30dfcb27_hq.jpg",
      "descripcion": "An armor similar to the rest, with similar characteristics and they managed to defeat many of the Extremis soldiers."
    },
    {
      "id": 11,
      "imagen": "https://pm1.aminoapps.com/6708/15674a3a58a13e9e380da3a165fc44357c986988_hq.jpg",
      "descripcion": "For this Armor, the decision was made to make it specifically more resistant in the torso area to favor the balance of weight accordingly to the more pronounced sides."
    },
    {
      "id": 12,
      "imagen": "https://pm1.aminoapps.com/6708/19ea6402694437c124b0b5fe465d6f50f10908c0_hq.jpg",
      "descripcion": "Improved version of the mk 11, It was part of the prototype units to improve the Aerodynamics of the suits, that is why the lack of color."
    },
    {
      "id": 13,
      "imagen": "https://pm1.aminoapps.com/6708/7b58a05230c139dae55da9733740a6d58ba83ac1_hq.jpg",
      "descripcion": "Improved version of the mk 12, second prototype to improve aerodynamics, which is why the more subtle finishes are more visible."
    },
    {
      "id": 14,
      "imagen": "https://pm1.aminoapps.com/6708/982cd520d07d0adfc52a4e0b9823e1dd3710b3dc_hq.jpg",
      "descripcion": "Prototype armor that linked not only the speed and dynamics of its previous versions, but now also added a lethal version."
    },
    {
      "id": 15,
      "imagen": "https://pm1.aminoapps.com/6708/9d9e667b8795bcde6efd689eb1becbdf44165130_hq.jpg",
      "descripcion": "The first special armor and also the first named one, this armor was made as a prototype stealth suit based on the MK I stealth armor and also the MK II."
    },
    {
      "id": 16,
      "imagen": "https://pm1.aminoapps.com/6708/15391bdab5893e3db4479af8a624cc8bffd594ed_hq.jpg",
      "descripcion": "Improved version of the MK XV, this armor is a refined version of the stealth suit based on the MK III, MK IV stealth armor. Its particular name is due to the tastes of MR. stark"
    },
    {
      "id": 17,
      "imagen": "https://pm1.aminoapps.com/6708/37c7fe87713853bcd139ee7d141f4668884f4960_hq.jpg",
      "descripcion": "Special heavy artillery armor capable of firing several powerful shots from the core thanks to the mini reactor it contained."
    },
    {
      "id": 18,
      "imagen": "https://pm1.aminoapps.com/6708/94e967117fe52108babdd76a217d655db43f5963_hq.jpg",
      "descripcion": "Improved version of the MK XVII, this armor is an improved version of a heavy artillery suit. Its particular name is due to the 'attractive' appearance of this Armor."
    },
    {
      "id": 19,
      "imagen": "https://pm1.aminoapps.com/6708/647e2807eeb681e5c456377ee9770ec990ff0e81_hq.jpg",
      "descripcion": "Armor made as a prototype of high speed armor and artillery. Its particular name is due to the similarity in power and speed with the 'big cat'."
    },
    {
      "id": 20,
      "imagen": "https://pm1.aminoapps.com/6708/b361f1bf1451c9e1b25032e99f42d1d7d79de870_hq.jpg",
      "descripcion": "Improved version of the MK XIX, this Armor increased its speed considerably. Its particular name is due to the speed and colors that this Armor had."
    },
    {
      "id": 21,
      "imagen": "https://pm1.aminoapps.com/6708/0e3364f78c04d3a53e82d2d6a88c5a256849bd01_hq.jpg",
      "descripcion": "Armor made as a tribute to King Midas who turned everything he touched into gold, it has nothing that particularly distinguishes it except for its particular color."
    },
    {
      "id": 22,
      "imagen": "https://pm1.aminoapps.com/6708/bc3aff68d44259ae593666f52640151a6bf60d0b_hq.jpg",
      "descripcion": "Armor without any type of specialty. Painted with flames and chrome details, the only rarity is being the first armor with an ARC reactor in the shape of an inverted rectangle. Its particular name is in honor of the vehicle that inspired SR. Stark to put color on his armor."
    },
    {
      "id": 23,
      "imagen": "https://pm1.aminoapps.com/6708/7c3cdf0a6be9cc644e850cdd81c20e9a1fac76eb_hq.jpg",
      "descripcion": "Armor made to be able to withstand extreme temperatures, both positive and negative values. Its particular name is due to the fact that this armor could absorb radiation to the point of not manifesting it in the form of a shadow."
    },
    {
      "id": 24,
      "imagen": "https://pm1.aminoapps.com/6708/72cab6ce9b76a31de790a5b0cfa36408c78589d3_hq.jpg",
      "descripcion": "This armor was made with the purpose of being a shield, its great armor capable of resisting large projectiles AND explosions. Their particular names are related to Tanks that can withstand almost any damage."
    },
    {
      "id": 25,
      "imagen": "https://pm1.aminoapps.com/6708/0a56ffbabbed65cfd47551fbf85411e1aa961087_hq.jpg",
      "descripcion": "Armor made to help in heavy construction situations, thus creating a tool capable of crossing any wall, in addition to being the first armor with a line-shaped ARC reactor. His particular name is due to the fact that he was the first to carry out work of crossing walls without the need for a worker to get hurt."
    },
    {
      "id": 26,
      "imagen": "https://pm1.aminoapps.com/6708/132d70489459af45af5c77181c9c131f4e166b11_hq.jpg",
      "descripcion": "Second version of the armor made to help in heavy construction situations. Its name is due to being the second model of this Armor."
    },
    {
      "id": 27,
      "imagen": "https://pm1.aminoapps.com/6708/d86f05d91d199f5427153aaa7c694cd4079ab712_hq.jpg",
      "descripcion": "An armor created in order to help MR. Stark when he needed some fun. Its particular name is due to what it represented for the SR. Stark."
    },
    {
      "id": 28,
      "imagen": "https://pm1.aminoapps.com/6708/90f59ff6660710674d24d381347dc9a1e8a6dc6c_hq.jpg",
      "descripcion": "Armor made for strong radiation or toxic situations. His particular name is a Mystery to me."
    },
    {
      "id": 29,
      "imagen": "https://pm1.aminoapps.com/6709/00f525f3eb93dbeeb26f10381f412fb2c4be6b45_hq.jpg",
      "descripcion": "Armor made to be able to help in agile construction situations. Its particular name is due to the fact that it held its tool on only one end."
    },
    {
      "id": 30,
      "imagen": "https://pm1.aminoapps.com/6709/72791e417a218468836a8a257fffc22f7411257e_hq.jpg",
      "descripcion": "Prototype armor of the silver centurion. Its particular name is due to the style of this armor."
    },
    {
      "id": 31,
      "imagen": "https://pm1.aminoapps.com/6709/5fc99812b5add703ee93d6d22c47a942022c48e4_hq.jpg",
      "descripcion": "An improved version of the MK XX, this armor is also a prototype of the silver centurion in addition to being an extreme speed armor. Its particular name is due to the part used to move engines."
    },
    {
      "id": 32,
      "imagen": "https://pm1.aminoapps.com/6709/6035830705c5d51578b99649f83973095cf50652_hq.jpg",
      "descripcion": "An Armor without any specifications, although MR. Stark said it was Cassanova's competition. The reason for its particular name is unknown."
    },
    {
      "id": 33,
      "imagen": "https://pm1.aminoapps.com/6709/6c8e25ecf6efb390c32b170ecd57fe7aca7d92ae_hq.jpg",
      "descripcion": "Final version of the armor with a strong magnet capable of attracting any metal and with hidden blades in the arms."
    },
    {
      "id": 34,
      "imagen": "https://pm1.aminoapps.com/6709/59664ad33c96dfa06a6c8989dfc1b6c7487197e0_hq.jpg",
      "descripcion": "Prototype disaster rescue suit as well as being the first armor to have a claw instead of an arm. His particular name is due to the fact that he carried his Tool on that end."
    },
    {
      "id": 35,
      "imagen": "https://pm1.aminoapps.com/6709/55fa5eb78f7495f9920953ea354feab42b2b57bb_hq.jpg",
      "descripcion": "An improved version of the MK XXXV, this is armor perfected for rescue or disaster situations."
    },
    {
      "id": 36,
      "imagen": "https://pm1.aminoapps.com/6709/14e318c17246e7cfae0c15e7a8edf9df9e220b74_hq.jpg",
      "descripcion": "Special armor to control fights and riots. His particular name is due to his great bearing that generated respect."
    },
    {
      "id": 37,
      "imagen": "https://pm1.aminoapps.com/6709/f0a111ca222a9a1cb5a3f06866b06869e4b8b2e1_hq.jpg",
      "descripcion": "Special armor to be able to breathe underwater and underwater travel. Designed to operate in the ocean. Its unique name is due to the species of shark that lives at those depths."
    },
    {
      "id": 38,
      "imagen": "https://pm1.aminoapps.com/6709/c1a1f810edfeb9f44e77f781cbaed45087358b5a_hq.jpg",
      "descripcion": "Designed to lift and support quite heavy objects, thus being helpful in propping up structures. Its particular name is due to its shape."
    },
    {
      "id": 39,
      "imagen": "https://pm1.aminoapps.com/6709/49110b6b02b9c30d20b97b88306dcb933d46fb78_hq.jpg",
      "descripcion": "Special armor to be able to travel to space. Its particular name is due to the fact that it was observed from space with a pulsar crossing space."
    },
    {
      "id": 40,
      "imagen": "https://pm1.aminoapps.com/6709/fde3c00d3e1ee1b4a423e37dc2578537ffdb2683_hq.jpg",
      "descripcion": "An improved version of the MK XXXI, this is an improved hyper-speed armor capable of going at mach 5. Its particular name is due to its strength and speed."
    },
    {
      "id": 41,
      "imagen": "https://pm1.aminoapps.com/6709/04f600c04a436ba77282597e8c748989240b2f05_hq.jpg",
      "descripcion": "Armor made as a prototype of a modular suit, its peculiarity was that it could move each fragment of its body in different directions and be rebuilt with precision."
    },
    {
      "id": 42,
      "imagen": "https://pm1.aminoapps.com/6709/19ae451f4aa0aa27d80cab944a9dc43428848b28_hq.jpg",
      "descripcion": "Designed for automatic deployment, the suit is made up of several separate sections that can move in small capsules. Every part of you can fly and automatically join the user. It can be summoned at any time, in response to impulses transmitted by microchips implanted in the SR's left arm. Stark."
    },
    {
      "id": 43,
      "imagen": "https://i.pinimg.com/originals/13/79/1a/13791aaabd448cc1101900d1d93badbc.jpg",
      "descripcion": "An improved version of the MK XXXXIII, this armor is an improved version of a modular suit. It has significant improvements, not only in technology but also better weapons and capabilities."
    },
    {
      "id": 44,
      "imagen": "https://th.bing.com/th/id/OIP.BgidbZXXvfgFQ2KsU5GVLgAAAA?pid=ImgDet&rs=1",
      "descripcion": "The Hulkbuster is a gigantic armor specially designed for combat against enemies with superhuman strength and endurance, like the Hulk. It was designed for the specific purpose of containing and neutralizing the Hulk should he become uncontrollable or pose a security threat. This suit is significantly larger and heavier than conventional Iron Man armors. It features a sturdy build and heavy firepower, including rocket-powered fists and energy weapons. Additionally, the Hulkbuster is capable of withstanding extremely powerful attacks and providing formidable defense against the Hulk's attacks and blows. Its particular name comes from the Hulk himself."
    },
    {
      "id": 47,
      "imagen": "https://i.pinimg.com/originals/82/6f/92/826f9201f6943bb8372d02349ab796a8.jpg",
      "descripcion": "The MK XXXXVII inherits advanced features from previous versions, such as rapid deployment capability and combat versatility. It is equipped with repulsor rays, missiles, and a wide variety of high-tech weapons and devices. In addition, it features improvements in terms of maneuverability and flight, allowing SR. Stark confront threats more effectively."
    },
    {
      "id": 48,
      "imagen": "https://i.pinimg.com/originals/a3/8d/ba/a38dbabab89520e15e05ae4cbc7e77a1.jpg",
      "descripcion": "This armor is more advanced than any other armor in progress, as it has many useful capabilities and functions for Tony to use at his disposal. Like the Mark 45, 46 and 47, this armor has the FRIDAY operating system built in and has some of the most advanced weapons and technology compared to other SR armors. Stark has built. This armor features advanced nanotechnology similar to Wakanda's technology and Black Panther's suit, this nano technology allows the armor to have different shapes and special characteristics. The MK XXXXVIII has a hull that can be completely deformed if necessary."
    }
  ]
}
